# Скласти програму введення оцінки P, отриманої студентами, і видачі тексту
# „Молодець!”, Якщо P = 5, „Добре!”, Якщо P = 4 і „Можеш краще!”, Якщо P ≤ 3
# на python
#--------------------------------------------------------------------------------
def student_feedback():

    P = int(input("Введіть оцінку студента (від 1 до 5): "))

    if P == 5:
        print("Молодець!")
    elif P == 4:
        print("Добре!")
    elif P == 3:
        print("Можеш краще!")
    elif P == 2:
        print("Лузеер!")
    elif P == 1:
        print("вбийся...")
    else:
        print("Невірна оцінка. Введіть оцінку від 1 до 5.")

student_feedback()
